app/controllers/films_controller.rb

SELECT "films".* FROM "films"
---
  def index
    @films = Film.all

INSERT INTO "films" ("Film_title", "description", "Length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "films" ("Film_title", "description", "Length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Film_title", "Titanic"], ["description", "A film that made me cry"], ["Length", "78 minutes"], ["created_at", "2019-12-15 20:58:37.150491"], ["updated_at", "2019-12-15 20:58:37.150491"]]
---
  def create
    @film = Film.new(film_params)

    respond_to do |format|
      if @film.save
        format.html { redirect_to @film, notice: t('film_status.created') }

UPDATE "films" SET "Film_title" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["Film_title", "Four Lions"], ["updated_at", "2019-11-12 17:55:31.551694"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @film.update(film_params)

DELETE FROM "films" WHERE "films"."id" = ?  [["id", 1]]
---
  def destroy
    @film.destroy
    respond_to do |format|
      format.html { redirect_to films_url, notice: t('film_status.destroyed') }

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_film
      @film = Film.find(params[:id])